EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
/*
 * Copyright 2017 Emcraft Systems
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 */

#ifndef __DTS_IMXRT105X_PINFUNC_H
#define __DTS_IMXRT105X_PINFUNC_H

#define MXRT105X_PAD_HYS		(1 << 16)

#define MXRT105X_PAD_PUS(n)		((n & 0x3) << 14)
#define MXRT105X_PAD_PUS_100K_PD	MXRT105X_PAD_PUS(0)
#define MXRT105X_PAD_PUS_47K_PU		MXRT105X_PAD_PUS(1)
#define MXRT105X_PAD_PUS_100K_PU	MXRT105X_PAD_PUS(2)
#define MXRT105X_PAD_PUS_22K_PU		MXRT105X_PAD_PUS(3)

#define MXRT105X_PAD_PUE		(1 << 13)
#define MXRT105X_PAD_PKE		(1 << 12)
#define MXRT105X_PAD_ODE		(1 << 11)

#define MXRT105X_PAD_SPEED(n)		((n & 0x3) << 6)
#define MXRT105X_PAD_SPEED_50MHZ	MXRT105X_PAD_SPEED(0)
#define MXRT105X_PAD_SPEED_100MHZ_1	MXRT105X_PAD_SPEED(1)
#define MXRT105X_PAD_SPEED_100MHZ_2	MXRT105X_PAD_SPEED(2)
#define MXRT105X_PAD_SPEED_200MHZ	MXRT105X_PAD_SPEED(3)

#define MXRT105X_PAD_DSE(n)		((n & 0x7) << 3)
#define MXRT105X_PAD_DSE_DISABLED	MXRT105X_PAD_DSE(0)
#define MXRT105X_PAD_DSE_150_OHM	MXRT105X_PAD_DSE(1)
#define MXRT105X_PAD_DSE_75_OHM		MXRT105X_PAD_DSE(2)
#define MXRT105X_PAD_DSE_50_OHM		MXRT105X_PAD_DSE(3)
#define MXRT105X_PAD_DSE_37_OHM		MXRT105X_PAD_DSE(4)
#define MXRT105X_PAD_DSE_30_OHM		MXRT105X_PAD_DSE(5)
#define MXRT105X_PAD_DSE_25_OHM		MXRT105X_PAD_DSE(6)
#define MXRT105X_PAD_DSE_21_OHM		MXRT105X_PAD_DSE(7)

#define MXRT105X_PAD_SRE_SLOW		(0 << 0)
#define MXRT105X_PAD_SRE_FAST		(1 << 0)

#define MXRT105X_PAD_CFG_UART		(MXRT105X_PAD_PKE | MXRT105X_PAD_PUS_100K_PD | \
					 MXRT105X_PAD_SPEED_100MHZ_2 | \
					 MXRT105X_PAD_DSE_25_OHM)

#define MXRT105X_PAD_CFG_GPIO		(MXRT105X_PAD_PUS_100K_PU | MXRT105X_PAD_PUE | \
					 MXRT105X_PAD_PKE | MXRT105X_PAD_DSE_30_OHM | \
					 MXRT105X_PAD_SPEED_100MHZ_1 | MXRT105X_PAD_SRE_FAST)

/*
 * The pin function ID is a tuple of
 * <mux_reg conf_reg input_reg mux_mode input_val>
 */
#define MXRT105X_PAD_EMC_00_SEMC_DATA00			0x0014 0x0204 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_00_FLEXPWM4_PWMA00		0x0014 0x0204 0x0494 0x1 0x0
#define MXRT105X_PAD_EMC_00_LPSPI2_SCK			0x0014 0x0204 0x0500 0x2 0x1
#define MXRT105X_PAD_EMC_00_XBAR1_XBAR_IN02		0x0014 0x0204 0x060c 0x3 0x0
#define MXRT105X_PAD_EMC_00_FLEXIO1_FLEXIO00		0x0014 0x0204 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_00_GPIO4_IO00			0x0014 0x0204 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_00_JTAG_DONE			0x0014 0x0204 0x0000 0x7 0x0

#define MXRT105X_PAD_EMC_01_SEMC_DATA01			0x0018 0x0208 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_01_FLEXPWM4_PWMB00		0x0018 0x0208 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_01_LPSPI2_PCS0			0x0018 0x0208 0x04fc 0x2 0x1
#define MXRT105X_PAD_EMC_01_XBAR1_IN03			0x0018 0x0208 0x0610 0x3 0x0
#define MXRT105X_PAD_EMC_01_FLEXIO1_FLEXIO01		0x0018 0x0208 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_01_GPIO4_IO01			0x0018 0x0208 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_01_JTAG_DE_B			0x0018 0x0208 0x0000 0x7 0x0

#define MXRT105X_PAD_EMC_02_SEMC_DATA02			0x001c 0x020c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_02_FLEXPWM4_PWMA01		0x001c 0x020c 0x0498 0x1 0x0
#define MXRT105X_PAD_EMC_02_LPSPI2_SDO			0x001c 0x020c 0x0508 0x2 0x1
#define MXRT105X_PAD_EMC_02_XBAR1_INOUT04		0x001c 0x020c 0x0614 0x3 0x0
#define MXRT105X_PAD_EMC_02_FLEXIO1_FLEXIO02		0x001c 0x020c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_02_GPIO4_IO02			0x001c 0x020c 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_02_JTAG_FAIL			0x001c 0x020c 0x0000 0x7 0x0

#define MXRT105X_PAD_EMC_03_SEMC_DATA03			0x0020 0x0210 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_03_FLEXPWM4_PWMB01		0x0020 0x0210 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_03_LPSPI2_SDI			0x0020 0x0210 0x0504 0x2 0x1
#define MXRT105X_PAD_EMC_03_XBAR1_INOUT05		0x0020 0x0210 0x0618 0x3 0x0
#define MXRT105X_PAD_EMC_03_FLEXIO1_FLEXIO03		0x0020 0x0210 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_03_GPIO4_IO03			0x0020 0x0210 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_03_JTAG_ACTIVE			0x0020 0x0210 0x0000 0x7 0x0

#define MXRT105X_PAD_EMC_04_SEMC_DATA04			0x0024 0x0214 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_04_FLEXPWM4_PWMA02		0x0024 0x0214 0x049c 0x1 0x0
#define MXRT105X_PAD_EMC_04_SAI2_TX_DATA		0x0024 0x0214 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_04_XBAR1_INOUT06		0x0024 0x0214 0x061c 0x3 0x0
#define MXRT105X_PAD_EMC_04_FLEXIO1_FLEXIO04		0x0024 0x0214 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_04_GPIO4_IO04			0x0024 0x0214 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_05_SEMC_DATA05			0x0028 0x0218 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_05_FLEXPWM4_PWMB02		0x0028 0x0218 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_05_SAI2_TX_SYNC		0x0028 0x0218 0x05c4 0x2 0x0
#define MXRT105X_PAD_EMC_05_XBAR1_INOUT07		0x0028 0x0218 0x0620 0x3 0x0
#define MXRT105X_PAD_EMC_05_FLEXIO1_FLEXIO05		0x0028 0x0218 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_05_GPIO4_IO05			0x0028 0x0218 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_06_SEMC_DATA06			0x002c 0x021c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_06_FLEXPWM2_PWMA00		0x002c 0x021c 0x0478 0x1 0x0
#define MXRT105X_PAD_EMC_06_SAI2_TX_BCLK		0x002c 0x021c 0x05c0 0x2 0x0
#define MXRT105X_PAD_EMC_06_XBAR1_INOUT08		0x002c 0x021c 0x0624 0x3 0x0
#define MXRT105X_PAD_EMC_06_FLEXIO1_FLEXIO06		0x002c 0x021c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_06_GPIO4_IO06			0x002c 0x021c 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_07_SEMC_DATA07			0x0030 0x0220 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_07_FLEXPWM2_PWMB00		0x0030 0x0220 0x0488 0x1 0x0
#define MXRT105X_PAD_EMC_07_SAI2_MCLK			0x0030 0x0220 0x05b0 0x2 0x0
#define MXRT105X_PAD_EMC_07_XBAR1_INOUT09		0x0030 0x0220 0x0628 0x3 0x0
#define MXRT105X_PAD_EMC_07_FLEXIO1_FLEXIO07		0x0030 0x0220 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_07_GPIO4_IO07			0x0030 0x0220 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_08_SEMC_DM00			0x0034 0x0224 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_08_FLEXPWM2_PWMA01		0x0034 0x0224 0x047c 0x1 0x0
#define MXRT105X_PAD_EMC_08_SAI2_RX_DATA		0x0034 0x0224 0x05b8 0x2 0x0
#define MXRT105X_PAD_EMC_08_XBAR1_INOUT17		0x0034 0x0224 0x062c 0x3 0x0
#define MXRT105X_PAD_EMC_08_FLEXIO1_FLEXIO08		0x0034 0x0224 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_08_GPIO4_IO08			0x0034 0x0224 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_09_SEMC_ADDR00			0x0038 0x0228 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_09_FLEXPWM2_PWMB01		0x0038 0x0228 0x048c 0x1 0x0
#define MXRT105X_PAD_EMC_09_SAI2_RX_SYNC		0x0038 0x0228 0x05bc 0x2 0x0
#define MXRT105X_PAD_EMC_09_FLEXCAN2_TX			0x0038 0x0228 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_09_FLEXIO1_FLEXIO09		0x0038 0x0228 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_09_GPIO4_IO09			0x0038 0x0228 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_10_SEMC_ADDR01			0x003c 0x022c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_10_FLEXPWM2_PWMA02		0x003c 0x022c 0x0480 0x1 0x0
#define MXRT105X_PAD_EMC_10_SAI2_RX_BCLK		0x003c 0x022c 0x05b4 0x2 0x0
#define MXRT105X_PAD_EMC_10_FLEXCAN2_RX			0x003c 0x022c 0x0450 0x3 0x0
#define MXRT105X_PAD_EMC_10_FLEXIO1_FLEXIO10		0x003c 0x022c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_10_GPIO4_IO10			0x003c 0x022c 0x0000 0x5 0x0

