EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
#define MXRT105X_PAD_EMC_11_SEMC_ADDR02			0x0040 0x0230 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_11_FLEXPWM2_PWMB02		0x0040 0x0230 0x0490 0x1 0x0
#define MXRT105X_PAD_EMC_11_LPI2C4_SDA			0x0040 0x0230 0x04e8 0x2 0x0
#define MXRT105X_PAD_EMC_11_USDHC2_RESET_B		0x0040 0x0230 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_11_FLEXIO1_FLEXIO11		0x0040 0x0230 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_11_GPIO4_IO11			0x0040 0x0230 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_12_SEMC_ADDR03			0x0044 0x0234 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_12_XBAR1_IN24			0x0044 0x0234 0x0640 0x1 0x0
#define MXRT105X_PAD_EMC_12_LPI2C4_SCL			0x0044 0x0234 0x04e4 0x2 0x0
#define MXRT105X_PAD_EMC_12_USDHC1_WP			0x0044 0x0234 0x05d8 0x3 0x0
#define MXRT105X_PAD_EMC_12_FLEXPWM1_PWMA03		0x0044 0x0234 0x0454 0x4 0x1
#define MXRT105X_PAD_EMC_12_GPIO4_IO12			0x0044 0x0234 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_13_SEMC_ADDR04			0x0048 0x0238 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_13_XBAR1_IN25			0x0048 0x0238 0x0650 0x1 0x1
#define MXRT105X_PAD_EMC_13_LPUART3_TX			0x0048 0x0238 0x053c 0x2 0x1
#define MXRT105X_PAD_EMC_13_MQS_RIGHT			0x0048 0x0238 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_13_FLEXPWM1_PWMB03		0x0048 0x0238 0x0464 0x4 0x1
#define MXRT105X_PAD_EMC_13_GPIO4_IO13			0x0048 0x0238 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_14_SEMC_ADDR05			0x004c 0x023c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_14_XBAR1_INOUT19		0x004c 0x023c 0x0654 0x1 0x0
#define MXRT105X_PAD_EMC_14_LPUART3_RX			0x004c 0x023c 0x0538 0x2 0x1
#define MXRT105X_PAD_EMC_14_MQS_LEFT			0x004c 0x023c 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_14_GPIO4_IO14			0x004c 0x023c 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_15_SEMC_ADDR06			0x0050 0x0240 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_15_XBAR1_IN20			0x0050 0x0240 0x0634 0x1 0x0
#define MXRT105X_PAD_EMC_15_LPUART3_CTS_B		0x0050 0x0240 0x0534 0x2 0x0
#define MXRT105X_PAD_EMC_15_SPDIF_OUT			0x0050 0x0240 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_15_QTIMER3_TIMER0		0x0050 0x0240 0x057c 0x4 0x0
#define MXRT105X_PAD_EMC_15_GPIO4_IO15			0x0050 0x0240 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_16_SEMC_ADDR07			0x0054 0x0244 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_16_XBAR1_IN21			0x0054 0x0244 0x0658 0x1 0x0
#define MXRT105X_PAD_EMC_16_LPUART3_RTS_B		0x0054 0x0244 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_16_SPDIF_IN			0x0054 0x0244 0x05c8 0x3 0x1
#define MXRT105X_PAD_EMC_16_QTIMER3_TIMER1		0x0054 0x0244 0x0580 0x4 0x1
#define MXRT105X_PAD_EMC_16_GPIO4_IO16			0x0054 0x0244 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_17_SEMC_ADDR08			0x0058 0x0248 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_17_FLEXPWM4_PWMA03		0x0058 0x0248 0x04a0 0x1 0x0
#define MXRT105X_PAD_EMC_17_LPUART4_CTS_B		0x0058 0x0248 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_17_FLEXCAN1_TX			0x0058 0x0248 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_17_QTIMER3_TIMER2		0x0058 0x0248 0x0584 0x4 0x0
#define MXRT105X_PAD_EMC_17_GPIO4_IO17			0x0058 0x0248 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_18_SEMC_ADDR09			0x005c 0x024c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_18_FLEXPWM4_PWMB03		0x005c 0x024c 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_18_LPUART4_RTS_B		0x005c 0x024c 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_18_FLEXCAN1_RX			0x005c 0x024c 0x044c 0x3 0x1
#define MXRT105X_PAD_EMC_18_QTIMER3_TIMER3		0x005c 0x024c 0x0588 0x4 0x0
#define MXRT105X_PAD_EMC_18_GPIO4_IO18			0x005c 0x024c 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_18_SNVS_VIO_5_CTL		0x005c 0x024c 0x0000 0x6 0x0

#define MXRT105X_PAD_EMC_19_SEMC_ADDR11			0x0060 0x0250 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_19_FLEXPWM2_PWMA03		0x0060 0x0250 0x0474 0x1 0x1
#define MXRT105X_PAD_EMC_19_LPUART4_TX			0x0060 0x0250 0x0544 0x2 0x1
#define MXRT105X_PAD_EMC_19_ENET_RDATA01		0x0060 0x0250 0x0438 0x3 0x0
#define MXRT105X_PAD_EMC_19_QTIMER2_TIMER0		0x0060 0x0250 0x056c 0x4 0x0
#define MXRT105X_PAD_EMC_19_GPIO4_IO19			0x0060 0x0250 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_19_SNVS_VIO_5			0x0060 0x0250 0x0000 0x6 0x0

#define MXRT105X_PAD_EMC_20_SEMC_ADDR12			0x0064 0x0254 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_20_FLEXPWM2_PWMB03		0x0064 0x0254 0x0484 0x1 0x1
#define MXRT105X_PAD_EMC_20_LPUART4_RX			0x0064 0x0254 0x0540 0x2 0x1
#define MXRT105X_PAD_EMC_20_ENET_RDATA00		0x0064 0x0254 0x0434 0x3 0x0
#define MXRT105X_PAD_EMC_20_QTIMER2_TIMER1		0x0064 0x0254 0x0570 0x4 0x0
#define MXRT105X_PAD_EMC_20_GPIO4_IO20			0x0064 0x0254 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_21_SEMC_BA0			0x0068 0x0258 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_21_FLEXPWM3_PWMA03		0x0068 0x0258 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_21_LPI2C3_SDA			0x0068 0x0258 0x04e0 0x2 0x0
#define MXRT105X_PAD_EMC_21_ENET_TDATA01		0x0068 0x0258 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_21_QTIMER2_TIMER2		0x0068 0x0258 0x0574 0x4 0x0
#define MXRT105X_PAD_EMC_21_GPIO4_IO21			0x0068 0x0258 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_22_SEMC_BA1			0x006c 0x025c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_22_FLEXPWM3_PWMB03		0x006c 0x025c 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_22_LPI2C3_SCL			0x006c 0x025c 0x04dc 0x2 0x0
#define MXRT105X_PAD_EMC_22_ENET_TDATA00		0x006c 0x025c 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_22_QTIMER2_TIMER3		0x006c 0x025c 0x0578 0x4 0x0
#define MXRT105X_PAD_EMC_22_GPIO4_IO22			0x006c 0x025c 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_23_SEMC_ADDR10			0x0070 0x0260 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_23_FLEXPWM1_PWMA00		0x0070 0x0260 0x0458 0x1 0x0
#define MXRT105X_PAD_EMC_23_LPUART5_TX			0x0070 0x0260 0x054c 0x2 0x0
#define MXRT105X_PAD_EMC_23_ENET_RX_EN			0x0070 0x0260 0x043c 0x3 0x0
#define MXRT105X_PAD_EMC_23_GPT1_CAPTURE2		0x0070 0x0260 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_23_GPIO4_IO23			0x0070 0x0260 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_24_SEMC_CAS			0x0074 0x0264 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_24_FLEXPWM1_PWMB00		0x0074 0x0264 0x0468 0x1 0x0
#define MXRT105X_PAD_EMC_24_LPUART5_RX			0x0074 0x0264 0x0548 0x2 0x0
#define MXRT105X_PAD_EMC_24_ENET_TX_EN			0x0074 0x0264 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_24_GPT1_CAPTURE1		0x0074 0x0264 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_24_GPIO4_IO24			0x0074 0x0264 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_25_SEMC_RAS			0x0078 0x0268 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_25_FLEXPWM1_PWMA01		0x0078 0x0268 0x045c 0x1 0x0
#define MXRT105X_PAD_EMC_25_LPUART6_TX			0x0078 0x0268 0x0554 0x2 0x0
#define MXRT105X_PAD_EMC_25_ENET_TX_CLK			0x0078 0x0268 0x0448 0x3 0x0
#define MXRT105X_PAD_EMC_25_ENET_REF_CLK		0x0078 0x0268 0x042c 0x4 0x0
#define MXRT105X_PAD_EMC_25_GPIO4_IO25			0x0078 0x0268 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_26_SEMC_CLK			0x007c 0x026c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_26_FLEXPWM1_PWMB01		0x007c 0x026c 0x046c 0x1 0x0
#define MXRT105X_PAD_EMC_26_LPUART6_RX			0x007c 0x026c 0x0550 0x2 0x0
#define MXRT105X_PAD_EMC_26_ENET_RX_ER			0x007c 0x026c 0x0440 0x3 0x0
#define MXRT105X_PAD_EMC_26_FLEXIO1_FLEXIO12		0x007c 0x026c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_26_GPIO4_IO26			0x007c 0x026c 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_27_SEMC_CKE			0x0080 0x0270 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_27_FLEXPWM1_PWMA02		0x0080 0x0270 0x0460 0x1 0x0
#define MXRT105X_PAD_EMC_27_LPUART5_RTS_B		0x0080 0x0270 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_27_LPSPI1_SCK			0x0080 0x0270 0x04f0 0x3 0x0
#define MXRT105X_PAD_EMC_27_FLEXIO1_FLEXIO13		0x0080 0x0270 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_27_GPIO4_IO27			0x0080 0x0270 0x0000 0x5 0x0

