EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
#define MXRT105X_PAD_EMC_28_SEMC_WE			0x0084 0x0274 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_28_FLEXPWM1_PWMB02		0x0084 0x0274 0x0470 0x1 0x0
#define MXRT105X_PAD_EMC_28_LPUART5_CTS_B		0x0084 0x0274 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_28_LPSPI1_SDO			0x0084 0x0274 0x04f8 0x3 0x0
#define MXRT105X_PAD_EMC_28_FLEXIO1_FLEXIO14		0x0084 0x0274 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_28_GPIO4_IO28			0x0084 0x0274 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_29_SEMC_CS0			0x0088 0x0278 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_29_FLEXPWM3_PWMA00		0x0088 0x0278 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_29_LPUART6_RTS_B		0x0088 0x0278 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_29_LPSPI1_SDI			0x0088 0x0278 0x04f4 0x3 0x0
#define MXRT105X_PAD_EMC_29_FLEXIO1_FLEXIO15		0x0088 0x0278 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_29_GPIO4_IO29			0x0088 0x0278 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_30_SEMC_DATA08			0x008c 0x027c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_30_FLEXPWM3_PWMB00		0x008c 0x027c 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_30_LPUART6_CTS_B		0x008c 0x027c 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_30_LPSPI1_PCS0			0x008c 0x027c 0x04ec 0x3 0x1
#define MXRT105X_PAD_EMC_30_CSI_DATA23			0x008c 0x027c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_30_GPIO4_IO30			0x008c 0x027c 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_31_SEMC_DATA09			0x0090 0x0280 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_31_FLEXPWM3_PWMA01		0x0090 0x0280 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_31_LPUART7_TX			0x0090 0x0280 0x055c 0x2 0x1
#define MXRT105X_PAD_EMC_31_LPSPI1_PCS1			0x0090 0x0280 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_31_CSI_DATA22			0x0090 0x0280 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_31_GPIO4_IO31			0x0090 0x0280 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_32_SEMC_DATA10			0x0094 0x0284 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_32_FLEXPWM3_PWMB01		0x0094 0x0284 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_32_LPUART7_RX			0x0094 0x0284 0x0558 0x2 0x1
#define MXRT105X_PAD_EMC_32_CCM_PMIC_RDY		0x0094 0x0284 0x03fc 0x3 0x4
#define MXRT105X_PAD_EMC_32_CSI_DATA21			0x0094 0x0284 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_32_GPIO3_IO18			0x0094 0x0284 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_33_SEMC_DATA11			0x0098 0x0288 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_33_FLEXPWM3_PWMA02		0x0098 0x0288 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_33_USDHC1_RESET_B		0x0098 0x0288 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_33_SAI3_RX_DATA		0x0098 0x0288 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_33_CSI_DATA20			0x0098 0x0288 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_33_GPIO3_IO19			0x0098 0x0288 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_34_SEMC_DATA12			0x009c 0x028c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_34_FLEXPWM3_PWMB02		0x009c 0x028c 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_34_USDHC1_VSELECT		0x009c 0x028c 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_34_SAI3_RX_SYNC		0x009c 0x028c 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_34_CSI_DATA19			0x009c 0x028c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_34_GPIO3_IO20			0x009c 0x028c 0x0000 0x5 0x0

#define MXRT105X_PAD_EMC_35_SEMC_DATA13			0x00a0 0x0290 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_35_XBAR1_INOUT18		0x00a0 0x0290 0x0630 0x1 0x0
#define MXRT105X_PAD_EMC_35_GPT1_COMPARE1		0x00a0 0x0290 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_35_SAI3_RX_BCLK		0x00a0 0x0290 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_35_CSI_DATA18			0x00a0 0x0290 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_35_GPIO3_IO21			0x00a0 0x0290 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_35_USDHC1_CD_B			0x00a0 0x0290 0x05d4 0x6 0x0

#define MXRT105X_PAD_EMC_36_SEMC_DATA14			0x00a4 0x0294 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_36_XBAR1_IN22			0x00a4 0x0294 0x0638 0x1 0x0
#define MXRT105X_PAD_EMC_36_GPT1_COMPARE2		0x00a4 0x0294 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_36_SAI3_TX_DATA		0x00a4 0x0294 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_36_CSI_DATA17			0x00a4 0x0294 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_36_GPIO3_IO22			0x00a4 0x0294 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_36_USDHC1_WP			0x00a4 0x0294 0x05d8 0x6 0x1

#define MXRT105X_PAD_EMC_37_SEMC_DATA15			0x00a8 0x0298 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_37_XBAR1_IN23			0x00a8 0x0298 0x063c 0x1 0x0
#define MXRT105X_PAD_EMC_37_GPT1_COMPARE3		0x00a8 0x0298 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_37_SAI3_MCLK			0x00a8 0x0298 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_37_CSI_DATA16			0x00a8 0x0298 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_37_GPIO3_IO23			0x00a8 0x0298 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_37_USDHC2_WP			0x00a8 0x0298 0x0608 0x6 0x0

#define MXRT105X_PAD_EMC_38_SEMC_DM01			0x00ac 0x029c 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_38_FLEXPWM1_PWMA03		0x00ac 0x029c 0x0454 0x1 0x2
#define MXRT105X_PAD_EMC_38_LPUART8_TX			0x00ac 0x029c 0x0564 0x2 0x2
#define MXRT105X_PAD_EMC_38_SAI3_TX_BCLK		0x00ac 0x029c 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_38_CSI_FIELD			0x00ac 0x029c 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_38_GPIO3_IO24			0x00ac 0x029c 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_38_USDHC2_VSELECT		0x00ac 0x029c 0x0000 0x6 0x0

#define MXRT105X_PAD_EMC_39_SEMC_DQS			0x00b0 0x02a0 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_39_FLEXPWM1_PWMB03		0x00b0 0x02a0 0x0464 0x1 0x2
#define MXRT105X_PAD_EMC_39_LPUART8_RX			0x00b0 0x02a0 0x0560 0x2 0x2
#define MXRT105X_PAD_EMC_39_SAI3_TX_SYNC		0x00b0 0x02a0 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_39_WDOG1_WDOG_B		0x00b0 0x02a0 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_39_GPIO3_IO25			0x00b0 0x02a0 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_39_USDHC2_CD_B			0x00b0 0x02a0 0x05e0 0x6 0x1

#define MXRT105X_PAD_EMC_40_SEMC_RDY			0x00b4 0x02a4 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_40_GPT2_CAPTURE2		0x00b4 0x02a4 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_40_LPSPI1_PCS2			0x00b4 0x02a4 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_40_USB_OTG2_OC			0x00b4 0x02a4 0x05cc 0x3 0x1
#define MXRT105X_PAD_EMC_40_ENET_MDC			0x00b4 0x02a4 0x0000 0x4 0x0
#define MXRT105X_PAD_EMC_40_GPIO3_IO26			0x00b4 0x02a4 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_40_USDHC2_RESET_B		0x00b4 0x02a4 0x0000 0x6 0x0

#define MXRT105X_PAD_EMC_41_SEMC_CSX00			0x00b8 0x02a8 0x0000 0x0 0x0
#define MXRT105X_PAD_EMC_41_GPT2_CAPTURE1		0x00b8 0x02a8 0x0000 0x1 0x0
#define MXRT105X_PAD_EMC_41_LPSPI1_PCS3			0x00b8 0x02a8 0x0000 0x2 0x0
#define MXRT105X_PAD_EMC_41_USB_OTG2_PWR		0x00b8 0x02a8 0x0000 0x3 0x0
#define MXRT105X_PAD_EMC_41_ENET_MDIO			0x00b8 0x02a8 0x0430 0x4 0x1
#define MXRT105X_PAD_EMC_41_GPIO3_IO27			0x00b8 0x02a8 0x0000 0x5 0x0
#define MXRT105X_PAD_EMC_41_USDHC1_VSELECT		0x00b8 0x02a8 0x0000 0x6 0x0

#define MXRT105X_PAD_AD_B0_00_FLEXPWM2_PWMA03		0x00bc 0x02ac 0x0474 0x0 0x2
#define MXRT105X_PAD_AD_B0_00_XBAR1_INOUT14		0x00bc 0x02ac 0x0644 0x1 0x0
#define MXRT105X_PAD_AD_B0_00_USB_OTG2_ID		0x00bc 0x02ac 0x03f8 0x3 0x0
#define MXRT105X_PAD_AD_B0_00_LPI2C1_SCLS		0x00bc 0x02ac 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B0_00_GPIO1_IO00		0x00bc 0x02ac 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_00_USDHC1_RESET_B		0x00bc 0x02ac 0x0000 0x6 0x0
#define MXRT105X_PAD_AD_B0_00_LPSPI3_SCK		0x00bc 0x02ac 0x0510 0x7 0x0

#define MXRT105X_PAD_AD_B0_01_FLEXPWM2_PWMB03		0x00c0 0x02b0 0x0484 0x0 0x2
#define MXRT105X_PAD_AD_B0_01_XBAR1_INOUT15		0x00c0 0x02b0 0x0648 0x1 0x0
#define MXRT105X_PAD_AD_B0_01_USB_OTG1_ID		0x00c0 0x02b0 0x03f4 0x3 0x0
#define MXRT105X_PAD_AD_B0_01_LPI2C1_SDAS		0x00c0 0x02b0 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B0_01_GPIO1_IO01		0x00c0 0x02b0 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_01_EWM_OUT_B			0x00c0 0x02b0 0x0000 0x6 0x0
#define MXRT105X_PAD_AD_B0_01_LPSPI3_SDO		0x00c0 0x02b0 0x0518 0x7 0x0

#define MXRT105X_PAD_AD_B0_02_FLEXCAN2_TX		0x00c4 0x02b4 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_02_XBAR1_INOUT16		0x00c4 0x02b4 0x064c 0x1 0x0
#define MXRT105X_PAD_AD_B0_02_LPUART6_TX		0x00c4 0x02b4 0x0554 0x2 0x1
#define MXRT105X_PAD_AD_B0_02_USB_OTG1_PWR		0x00c4 0x02b4 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B0_02_FLEXPWM1_PWMX00		0x00c4 0x02b4 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B0_02_GPIO1_IO02		0x00c4 0x02b4 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_02_LPI2C1_HREQ		0x00c4 0x02b4 0x0000 0x6 0x0
#define MXRT105X_PAD_AD_B0_02_LPSPI3_SDI		0x00c4 0x02b4 0x0514 0x7 0x0

#define MXRT105X_PAD_AD_B0_03_FLEXCAN2_RX		0x00c8 0x02b8 0x0450 0x0 0x1
#define MXRT105X_PAD_AD_B0_03_XBAR1_INOUT17		0x00c8 0x02b8 0x062c 0x1 0x1
#define MXRT105X_PAD_AD_B0_03_LPUART6_RX		0x00c8 0x02b8 0x0550 0x2 0x1
#define MXRT105X_PAD_AD_B0_03_USB_OTG1_OC		0x00c8 0x02b8 0x05d0 0x3 0x0
#define MXRT105X_PAD_AD_B0_03_FLEXPWM1_PWMX01		0x00c8 0x02b8 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B0_03_GPIO1_IO03		0x00c8 0x02b8 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_03_LPSPI3_PCS0		0x00c8 0x02b8 0x050c 0x7 0x0

#define MXRT105X_PAD_AD_B0_04_SRC_BOOT_MODE00		0x00cc 0x02bc 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_04_MQS_RIGHT			0x00cc 0x02bc 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B0_04_ENET_TX_DATA03		0x00cc 0x02bc 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_04_SAI2_TX_SYNC		0x00cc 0x02bc 0x05c4 0x3 0x1
#define MXRT105X_PAD_AD_B0_04_CSI_DATA09		0x00cc 0x02bc 0x041c 0x4 0x1
#define MXRT105X_PAD_AD_B0_04_GPIO1_IO04		0x00cc 0x02bc 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_04_PIT_TRIGGER00		0x00cc 0x02bc 0x0000 0x6 0x0
#define MXRT105X_PAD_AD_B0_04_LPSPI3_PCS1		0x00cc 0x02bc 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_05_SRC_BOOT_MODE01		0x00d0 0x02c0 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_05_MQS_LEFT			0x00d0 0x02c0 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B0_05_ENET_TX_DATA02		0x00d0 0x02c0 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_05_SAI2_TX_BCLK		0x00d0 0x02c0 0x05c0 0x3 0x1
#define MXRT105X_PAD_AD_B0_05_CSI_DATA08		0x00d0 0x02c0 0x0418 0x4 0x1
#define MXRT105X_PAD_AD_B0_05_GPIO1_IO05		0x00d0 0x02c0 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_05_XBAR1_INOUT17		0x00d0 0x02c0 0x062c 0x6 0x2
#define MXRT105X_PAD_AD_B0_05_LPSPI3_PCS2		0x00d0 0x02c0 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_06_JTAG_TMS			0x00d4 0x02c4 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_06_GPT2_COMPARE1		0x00d4 0x02c4 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B0_06_ENET_RX_CLK		0x00d4 0x02c4 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_06_SAI2_RX_BCLK		0x00d4 0x02c4 0x05b4 0x3 0x1
#define MXRT105X_PAD_AD_B0_06_CSI_DATA07		0x00d4 0x02c4 0x0414 0x4 0x1
#define MXRT105X_PAD_AD_B0_06_GPIO1_IO06		0x00d4 0x02c4 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_06_XBAR1_INOUT18		0x00d4 0x02c4 0x0630 0x6 0x1
#define MXRT105X_PAD_AD_B0_06_LPSPI3_PCS3		0x00d4 0x02c4 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_07_JTAG_TCK			0x00d8 0x02c8 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_07_GPT2_COMPARE2		0x00d8 0x02c8 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B0_07_ENET_TX_ER		0x00d8 0x02c8 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_07_SAI2_RX_SYNC		0x00d8 0x02c8 0x05bc 0x3 0x1
#define MXRT105X_PAD_AD_B0_07_CSI_DATA06		0x00d8 0x02c8 0x0410 0x4 0x1
#define MXRT105X_PAD_AD_B0_07_GPIO1_IO07		0x00d8 0x02c8 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_07_XBAR1_INOUT19		0x00d8 0x02c8 0x0654 0x6 0x1
#define MXRT105X_PAD_AD_B0_07_ENET_1588_EVENT3_OUT	0x00d8 0x02c8 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_08_JTAG_MOD			0x00dc 0x02cc 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_08_GPT2_COMPARE3		0x00dc 0x02cc 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B0_08_ENET_RX_DATA03		0x00dc 0x02cc 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_08_SAI2_RX_DATA		0x00dc 0x02cc 0x05b8 0x3 0x1
#define MXRT105X_PAD_AD_B0_08_CSI_DATA05		0x00dc 0x02cc 0x040c 0x4 0x1
#define MXRT105X_PAD_AD_B0_08_GPIO1_IO08		0x00dc 0x02cc 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_08_XBAR1_IN20		0x00dc 0x02cc 0x0634 0x6 0x1
#define MXRT105X_PAD_AD_B0_08_ENET_1588_EVENT3_IN	0x00dc 0x02cc 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_09_JTAG_TDI			0x00e0 0x02d0 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_09_FLEXPWM2_PWMA03		0x00e0 0x02d0 0x0474 0x1 0x3
#define MXRT105X_PAD_AD_B0_09_ENET_RX_DATA02		0x00e0 0x02d0 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_09_SAI2_TX_DATA		0x00e0 0x02d0 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B0_09_CSI_DATA04		0x00e0 0x02d0 0x0408 0x4 0x1
#define MXRT105X_PAD_AD_B0_09_GPIO1_IO09		0x00e0 0x02d0 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_09_XBAR1_IN21		0x00e0 0x02d0 0x0658 0x6 0x1
#define MXRT105X_PAD_AD_B0_09_GPT2_CLK			0x00e0 0x02d0 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_10_JTAG_TDO			0x00e4 0x02d4 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_10_FLEXPWM1_PWMA03		0x00e4 0x02d4 0x0454 0x1 0x3
#define MXRT105X_PAD_AD_B0_10_ENET_CRS			0x00e4 0x02d4 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_10_SAI2_MCLK			0x00e4 0x02d4 0x05b0 0x3 0x1
#define MXRT105X_PAD_AD_B0_10_CSI_DATA03		0x00e4 0x02d4 0x0404 0x4 0x1
#define MXRT105X_PAD_AD_B0_10_GPIO1_IO10		0x00e4 0x02d4 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_10_XBAR1_IN22		0x00e4 0x02d4 0x0638 0x6 0x1
#define MXRT105X_PAD_AD_B0_10_ENET_1588_EVENT0_OUT	0x00e4 0x02d4 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B0_11_JTAG_TRSTB		0x00e8 0x02d8 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_11_FLEXPWM1_PWMB03		0x00e8 0x02d8 0x0464 0x1 0x3
#define MXRT105X_PAD_AD_B0_11_ENET_COL			0x00e8 0x02d8 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_11_WDOG1_WDOG_B		0x00e8 0x02d8 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B0_11_CSI_DATA02		0x00e8 0x02d8 0x0400 0x4 0x1
#define MXRT105X_PAD_AD_B0_11_GPIO1_IO11		0x00e8 0x02d8 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_11_XBAR1_IN23		0x00e8 0x02d8 0x063c 0x6 0x1
#define MXRT105X_PAD_AD_B0_11_ENET_1588_EVENT0_IN	0x00e8 0x02d8 0x0444 0x7 0x1

