EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
#define MXRT105X_PAD_AD_B0_12_LPI2C4_SCL		0x00ec 0x02dc 0x04e4 0x0 0x1
#define MXRT105X_PAD_AD_B0_12_CCM_PMIC_READY		0x00ec 0x02dc 0x03fc 0x1 0x1
#define MXRT105X_PAD_AD_B0_12_LPUART1_TX		0x00ec 0x02dc 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_12_WDOG2_WDOG_B		0x00ec 0x02dc 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B0_12_FLEXPWM1_PWMX02		0x00ec 0x02dc 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B0_12_GPIO1_IO12		0x00ec 0x02dc 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_12_ENET_1588_EVENT1_OUT	0x00ec 0x02dc 0x0000 0x6 0x0

#define MXRT105X_PAD_AD_B0_13_LPI2C4_SDA		0x00f0 0x02e0 0x04e8 0x0 0x1
#define MXRT105X_PAD_AD_B0_13_LPUART1_RX		0x00f0 0x02e0 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_13_EWM_OUT_B			0x00f0 0x02e0 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B0_13_FLEXPWM1_PWMX03		0x00f0 0x02e0 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B0_13_GPIO1_IO13		0x00f0 0x02e0 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_13_ENET_1588_EVENT1_IN	0x00f0 0x02e0 0x0000 0x6 0x0

#define MXRT105X_PAD_AD_B0_14_USB_OTG2_OC		0x00f4 0x02e4 0x05cc 0x0 0x0
#define MXRT105X_PAD_AD_B0_14_XBAR1_IN24		0x00f4 0x02e4 0x0640 0x1 0x1
#define MXRT105X_PAD_AD_B0_14_LPUART1_CTS_B		0x00f4 0x02e4 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_14_ENET_1588_EVENT0_OUT	0x00f4 0x02e4 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B0_14_CSI_VSYNC			0x00f4 0x02e4 0x0428 0x4 0x0
#define MXRT105X_PAD_AD_B0_14_GPIO1_IO14		0x00f4 0x02e4 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_14_FLEXCAN2_TX		0x00f4 0x02e4 0x0000 0x6 0x0

#define MXRT105X_PAD_AD_B0_15_USB_OTG2_PWR		0x00f8 0x02e8 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B0_15_XBAR1_IN25		0x00f8 0x02e8 0x0650 0x1 0x0
#define MXRT105X_PAD_AD_B0_15_LPUART1_RTS_B		0x00f8 0x02e8 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B0_15_ENET_1588_EVENT0_IN	0x00f8 0x02e8 0x0444 0x3 0x0
#define MXRT105X_PAD_AD_B0_15_CSI_HSYNC			0x00f8 0x02e8 0x0420 0x4 0x0
#define MXRT105X_PAD_AD_B0_15_GPIO1_IO15		0x00f8 0x02e8 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B0_15_FLEXCAN2_RX		0x00f8 0x02e8 0x0450 0x6 0x2
#define MXRT105X_PAD_AD_B0_15_WDOG1_WDOG_RST_B_DEB	0x00f8 0x02e8 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_00_USB_OTG2_ID		0x00fc 0x02ec 0x03f8 0x0 0x1
#define MXRT105X_PAD_AD_B1_00_QTIMER3_TIMER0		0x00fc 0x02ec 0x057c 0x1 0x1
#define MXRT105X_PAD_AD_B1_00_LPUART2_CTS_B		0x00fc 0x02ec 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B1_00_LPI2C1_SCL		0x00fc 0x02ec 0x04cc 0x3 0x1
#define MXRT105X_PAD_AD_B1_00_WDOG1_B			0x00fc 0x02ec 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B1_00_GPIO1_IO16		0x00fc 0x02ec 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_00_USDHC1_WP			0x00fc 0x02ec 0x05d8 0x6 0x2
#define MXRT105X_PAD_AD_B1_00_KPP_ROW07			0x00fc 0x02ec 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_01_USB_OTG1_PWR		0x0100 0x02f0 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B1_01_QTIMER3_TIMER1		0x0100 0x02f0 0x0580 0x1 0x0
#define MXRT105X_PAD_AD_B1_01_LPUART2_RTS_B		0x0100 0x02f0 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B1_01_LPI2C1_SDA		0x0100 0x02f0 0x04d0 0x3 0x1
#define MXRT105X_PAD_AD_B1_01_CCM_PMIC_READY		0x0100 0x02f0 0x03fc 0x4 0x2
#define MXRT105X_PAD_AD_B1_01_GPIO1_IO17		0x0100 0x02f0 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_01_USDHC1_VSELECT		0x0100 0x02f0 0x0000 0x6 0x0

#define MXRT105X_PAD_AD_B1_02_USB_OTG1_ID		0x0104 0x02f4 0x03f4 0x0 0x1
#define MXRT105X_PAD_AD_B1_02_QTIMER3_TIMER2		0x0104 0x02f4 0x0584 0x1 0x1
#define MXRT105X_PAD_AD_B1_02_LPUART2_TX		0x0104 0x02f4 0x0530 0x2 0x1
#define MXRT105X_PAD_AD_B1_02_SPDIF_OUT			0x0104 0x02f4 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B1_02_ENET_1588_EVENT2_OUT	0x0104 0x02f4 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B1_02_GPIO1_IO18		0x0104 0x02f4 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_02_USDHC1_CD_B		0x0104 0x02f4 0x05d4 0x6 0x1
#define MXRT105X_PAD_AD_B1_02_KPP_ROW06			0x0104 0x02f4 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_03_USB_OTG1_OC		0x0108 0x02f8 0x05d0 0x0 0x1
#define MXRT105X_PAD_AD_B1_03_QTIMER3_TIMER3		0x0108 0x02f8 0x0588 0x1 0x1
#define MXRT105X_PAD_AD_B1_03_LPUART2_RX		0x0108 0x02f8 0x052c 0x2 0x1
#define MXRT105X_PAD_AD_B1_03_SPDIF_IN			0x0108 0x02f8 0x05c8 0x3 0x0
#define MXRT105X_PAD_AD_B1_03_ENET_1588_EVENT2_IN	0x0108 0x02f8 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B1_03_GPIO1_IO19		0x0108 0x02f8 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_03_USDHC2_CD_B		0x0108 0x02f8 0x05e0 0x6 0x0
#define MXRT105X_PAD_AD_B1_03_KPP_COL06			0x0108 0x02f8 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_04_FLEXSPI_DATA03		0x010c 0x02fc 0x04c4 0x0 0x1
#define MXRT105X_PAD_AD_B1_04_ENET_MDC			0x010c 0x02fc 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_04_LPUART3_CTS_B		0x010c 0x02fc 0x0534 0x2 0x1
#define MXRT105X_PAD_AD_B1_04_SPDIF_SR_CLK		0x010c 0x02fc 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B1_04_CSI_PIXCLK		0x010c 0x02fc 0x0424 0x4 0x0
#define MXRT105X_PAD_AD_B1_04_GPIO1_IO20		0x010c 0x02fc 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_04_USDHC2_DATA0		0x010c 0x02fc 0x05e8 0x6 0x1
#define MXRT105X_PAD_AD_B1_04_KPP_ROW05			0x010c 0x02fc 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_05_FLEXSPI_DATA02		0x0110 0x0300 0x04c0 0x0 0x1
#define MXRT105X_PAD_AD_B1_05_ENET_MDIO			0x0110 0x0300 0x0430 0x1 0x0
#define MXRT105X_PAD_AD_B1_05_LPUART3_RTS_B		0x0110 0x0300 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B1_05_SPDIF_OUT			0x0110 0x0300 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B1_05_CSI_MCLK			0x0110 0x0300 0x0000 0x4 0x0
#define MXRT105X_PAD_AD_B1_05_GPIO1_IO21		0x0110 0x0300 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_05_USDHC2_DATA1		0x0110 0x0300 0x05ec 0x6 0x1

#define MXRT105X_PAD_AD_B1_06_FLEXSPI_DATA01		0x0114 0x0304 0x04bc 0x0 0x1
#define MXRT105X_PAD_AD_B1_06_LPI2C3_SDA		0x0114 0x0304 0x04e0 0x1 0x2
#define MXRT105X_PAD_AD_B1_06_LPUART3_TX		0x0114 0x0304 0x053c 0x2 0x0
#define MXRT105X_PAD_AD_B1_06_SPDIF_LOCK		0x0114 0x0304 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B1_06_CSI_VSYNC			0x0114 0x0304 0x0428 0x4 0x1
#define MXRT105X_PAD_AD_B1_06_GPIO1_IO22		0x0114 0x0304 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_06_USDHC2_DATA2		0x0114 0x0304 0x05f0 0x6 0x1
#define MXRT105X_PAD_AD_B1_06_KPP_ROW04			0x0114 0x0304 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_07_FLEXSPI_DATA00		0x0118 0x0308 0x04b8 0x0 0x1
#define MXRT105X_PAD_AD_B1_07_LPI2C3_SCL		0x0118 0x0308 0x04dc 0x1 0x2
#define MXRT105X_PAD_AD_B1_07_LPUART3_RX		0x0118 0x0308 0x0538 0x2 0x0
#define MXRT105X_PAD_AD_B1_07_SPDIF_EXT_CLK		0x0118 0x0308 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B1_07_CSI_HSYNC			0x0118 0x0308 0x0420 0x4 0x1
#define MXRT105X_PAD_AD_B1_07_GPIO1_IO23		0x0118 0x0308 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_07_USDHC2_DATA3		0x0118 0x0308 0x05f4 0x6 0x1

#define MXRT105X_PAD_AD_B1_08_FLEXSPI_SS1_B		0x011c 0x030c 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B1_08_FLEXPWM4_PWMA00		0x011c 0x030c 0x0494 0x1 0x1
#define MXRT105X_PAD_AD_B1_08_FLEXCAN1_TX		0x011c 0x030c 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B1_08_CCM_PMIC_READY		0x011c 0x030c 0x03fc 0x3 0x3
#define MXRT105X_PAD_AD_B1_08_CSI_DATA09		0x011c 0x030c 0x041c 0x4 0x0
#define MXRT105X_PAD_AD_B1_08_GPIO1_IO24		0x011c 0x030c 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_08_USDHC2_CMD		0x011c 0x030c 0x05e4 0x6 0x1

#define MXRT105X_PAD_AD_B1_09_FLEXSPI_DQS		0x0120 0x0310 0x04a4 0x0 0x1
#define MXRT105X_PAD_AD_B1_09_FLEXPWM4_PWMA01		0x0120 0x0310 0x0498 0x1 0x1
#define MXRT105X_PAD_AD_B1_09_FLEXCAN1_RX		0x0120 0x0310 0x044c 0x2 0x2
#define MXRT105X_PAD_AD_B1_09_SAI1_MCLK			0x0120 0x0310 0x058c 0x3 0x1
#define MXRT105X_PAD_AD_B1_09_CSI_DATA08		0x0120 0x0310 0x0418 0x4 0x0
#define MXRT105X_PAD_AD_B1_09_GPIO1_IO25		0x0120 0x0310 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_09_USDHC2_CLK		0x0120 0x0310 0x05dc 0x6 0x1

#define MXRT105X_PAD_AD_B1_10_FLEXSPI_DATA03		0x0124 0x0314 0x04b4 0x0 0x1
#define MXRT105X_PAD_AD_B1_10_WDOG1_B			0x0124 0x0314 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_10_LPUART8_TX		0x0124 0x0314 0x0564 0x2 0x1
#define MXRT105X_PAD_AD_B1_10_SAI1_RX_SYNC		0x0124 0x0314 0x05a4 0x3 0x1
#define MXRT105X_PAD_AD_B1_10_CSI_DATA07		0x0124 0x0314 0x0414 0x4 0x0
#define MXRT105X_PAD_AD_B1_10_GPIO1_IO26		0x0124 0x0314 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_10_USDHC2_WP			0x0124 0x0314 0x0608 0x6 0x1

#define MXRT105X_PAD_AD_B1_11_FLEXSPI_DATA02		0x0128 0x0318 0x04b0 0x0 0x1
#define MXRT105X_PAD_AD_B1_11_EWM_OUT_B			0x0128 0x0318 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_11_LPUART8_RX		0x0128 0x0318 0x0560 0x2 0x1
#define MXRT105X_PAD_AD_B1_11_SAI1_RX_BCLK		0x0128 0x0318 0x0590 0x3 0x1
#define MXRT105X_PAD_AD_B1_11_CSI_DATA06		0x0128 0x0318 0x0410 0x4 0x0
#define MXRT105X_PAD_AD_B1_11_GPIO1_IO27		0x0128 0x0318 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_11_USDHC2_RESET_B		0x0128 0x0318 0x0000 0x6 0x0

#define MXRT105X_PAD_AD_B1_12_FLEXSPI_DATA01		0x012c 0x031c 0x04ac 0x0 0x1
#define MXRT105X_PAD_AD_B1_12_ACMP_OUT00		0x012c 0x031c 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_12_LPSPI3_PCS0		0x012c 0x031c 0x050c 0x2 0x1
#define MXRT105X_PAD_AD_B1_12_SAI1_RX_DATA00		0x012c 0x031c 0x0594 0x3 0x1
#define MXRT105X_PAD_AD_B1_12_CSI_DATA05		0x012c 0x031c 0x040c 0x4 0x0
#define MXRT105X_PAD_AD_B1_12_GPIO1_IO28		0x012c 0x031c 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_12_USDHC2_DATA4		0x012c 0x031c 0x05f8 0x6 0x1
#define MXRT105X_PAD_AD_B1_12_KPP_ROW01			0x012c 0x031c 0x0000 0x7 0x0

