EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
#define MXRT105X_PAD_AD_B1_13_FLEXSPI_DATA00		0x0130 0x0320 0x04a8 0x0 0x1
#define MXRT105X_PAD_AD_B1_13_ACMP_OUT01		0x0130 0x0320 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_13_LPSPI3_SDI		0x0130 0x0320 0x0514 0x2 0x1
#define MXRT105X_PAD_AD_B1_13_SAI1_TX_DATA00		0x0130 0x0320 0x0000 0x3 0x0
#define MXRT105X_PAD_AD_B1_13_CSI_DATA04		0x0130 0x0320 0x0408 0x4 0x0
#define MXRT105X_PAD_AD_B1_13_GPIO1_IO29		0x0130 0x0320 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_13_USDHC2_DATA5		0x0130 0x0320 0x05fc 0x6 0x1

#define MXRT105X_PAD_AD_B1_14_FLEXSPI_SCLK		0x0134 0x0324 0x04c8 0x0 0x1
#define MXRT105X_PAD_AD_B1_14_ACMP_OUT02		0x0134 0x0324 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_14_LPSPI3_SDO		0x0134 0x0324 0x0518 0x2 0x1
#define MXRT105X_PAD_AD_B1_14_SAI1_TX_BCLK		0x0134 0x0324 0x05a8 0x3 0x1
#define MXRT105X_PAD_AD_B1_14_CSI_DATA03		0x0134 0x0324 0x0404 0x4 0x0
#define MXRT105X_PAD_AD_B1_14_GPIO1_IO30		0x0134 0x0324 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_14_USDHC2_DATA6		0x0134 0x0324 0x0600 0x6 0x1
#define MXRT105X_PAD_AD_B1_14_KPP_ROW00			0x0134 0x0324 0x0000 0x7 0x0

#define MXRT105X_PAD_AD_B1_15_FLEXSPI_SS0_B		0x0138 0x0328 0x0000 0x0 0x0
#define MXRT105X_PAD_AD_B1_15_ACMP_OUT03		0x0138 0x0328 0x0000 0x1 0x0
#define MXRT105X_PAD_AD_B1_15_LPSPI3_SCK		0x0138 0x0328 0x0000 0x2 0x0
#define MXRT105X_PAD_AD_B1_15_SAI1_TX_SYNC		0x0138 0x0328 0x05ac 0x3 0x1
#define MXRT105X_PAD_AD_B1_15_CSI_DATA02		0x0138 0x0328 0x0400 0x4 0x0
#define MXRT105X_PAD_AD_B1_15_GPIO1_IO31		0x0138 0x0328 0x0000 0x5 0x0
#define MXRT105X_PAD_AD_B1_15_USDHC2_DATA7		0x0138 0x0328 0x0604 0x6 0x1

#define MXRT105X_PAD_B0_00_LCD_CLK			0x013c 0x032c 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_00_QTIMER1_TIMER0		0x013c 0x032c 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_00_MQS_RIGHT			0x013c 0x032c 0x0000 0x2 0x0
#define MXRT105X_PAD_B0_00_LPSPI4_PCS0			0x013c 0x032c 0x051c 0x3 0x0
#define MXRT105X_PAD_B0_00_FLEXIO2_FLEXIO00		0x013c 0x032c 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_00_GPIO2_IO00			0x013c 0x032c 0x0000 0x5 0x0

#define MXRT105X_PAD_B0_01_LCD_ENABLE			0x0140 0x0330 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_01_QTIMER1_TIMER1		0x0140 0x0330 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_01_MQS_LEFT			0x0140 0x0330 0x0000 0x2 0x0
#define MXRT105X_PAD_B0_01_LPSPI4_SDI			0x0140 0x0330 0x0524 0x3 0x0
#define MXRT105X_PAD_B0_01_FLEXIO2_FLEXIO01		0x0140 0x0330 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_01_GPIO2_IO01			0x0140 0x0330 0x0000 0x5 0x0

#define MXRT105X_PAD_B0_02_LCD_HSYNC			0x0144 0x0334 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_02_QTIMER1_TIMER2		0x0144 0x0334 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_02_FLEXCAN1_TX			0x0144 0x0334 0x0000 0x2 0x0
#define MXRT105X_PAD_B0_02_LPSPI4_SDO			0x0144 0x0334 0x0528 0x3 0x0
#define MXRT105X_PAD_B0_02_FLEXIO2_FLEXIO02		0x0144 0x0334 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_02_GPIO2_IO02			0x0144 0x0334 0x0000 0x5 0x0

#define MXRT105X_PAD_B0_03_LCD_VSYNC			0x0148 0x0338 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_03_QTIMER2_TIMER0		0x0148 0x0338 0x056c 0x1 0x1
#define MXRT105X_PAD_B0_03_FLEXCAN1_RX			0x0148 0x0338 0x044c 0x2 0x3
#define MXRT105X_PAD_B0_03_LPSPI4_SCK			0x0148 0x0338 0x0520 0x3 0x0
#define MXRT105X_PAD_B0_03_FLEXIO2_FLEXIO03		0x0148 0x0338 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_03_GPIO2_IO03			0x0148 0x0338 0x0000 0x5 0x0

#define MXRT105X_PAD_B0_04_LCD_DATA00			0x014c 0x033c 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_04_QTIMER2_TIMER1		0x014c 0x033c 0x0570 0x1 0x1
#define MXRT105X_PAD_B0_04_LPI2C2_SCL			0x014c 0x033c 0x04d4 0x2 0x1
#define MXRT105X_PAD_B0_04_FLEXIO2_FLEXIO04		0x014c 0x033c 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_04_GPIO2_IO04			0x014c 0x033c 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_04_SRC_BOOT_CFG00		0x014c 0x033c 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_05_LCD_DATA01			0x0150 0x0340 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_05_QTIMER2_TIMER2		0x0150 0x0340 0x0574 0x1 0x1
#define MXRT105X_PAD_B0_05_LPI2C2_SDA			0x0150 0x0340 0x04d8 0x2 0x1
#define MXRT105X_PAD_B0_05_FLEXIO2_FLEXIO05		0x0150 0x0340 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_05_GPIO2_IO05			0x0150 0x0340 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_05_SRC_BOOT_CFG01		0x0150 0x0340 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_06_LCD_DATA02			0x0154 0x0344 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_06_QTIMER3_TIMER0		0x0154 0x0344 0x057c 0x1 0x2
#define MXRT105X_PAD_B0_06_FLEXPWM2_PWMA00		0x0154 0x0344 0x0478 0x2 0x1
#define MXRT105X_PAD_B0_06_FLEXIO2_FLEXIO06		0x0154 0x0344 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_06_GPIO2_IO06			0x0154 0x0344 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_06_SRC_BOOT_CFG02		0x0154 0x0344 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_07_LCD_DATA03			0x0158 0x0348 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_07_QTIMER3_TIMER1		0x0158 0x0348 0x0580 0x1 0x2
#define MXRT105X_PAD_B0_07_FLEXPWM2_PWMB00		0x0158 0x0348 0x0488 0x2 0x1
#define MXRT105X_PAD_B0_07_FLEXIO2_FLEXIO07		0x0158 0x0348 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_07_GPIO2_IO07			0x0158 0x0348 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_07_SRC_BOOT_CFG03		0x0158 0x0348 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_08_LCD_DATA04			0x015c 0x034c 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_08_QTIMER3_TIMER2		0x015c 0x034c 0x0584 0x1 0x2
#define MXRT105X_PAD_B0_08_FLEXPWM2_PWMA01		0x015c 0x034c 0x047c 0x2 0x1
#define MXRT105X_PAD_B0_08_LPUART3_TX			0x015c 0x034c 0x053c 0x3 0x2
#define MXRT105X_PAD_B0_08_FLEXIO2_FLEXIO08		0x015c 0x034c 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_08_GPIO2_IO08			0x015c 0x034c 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_08_SRC_BOOT_CFG04		0x015c 0x034c 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_09_LCD_DATA05			0x0160 0x0350 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_09_QTIMER4_TIMER0		0x0160 0x0350 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_09_FLEXPWM2_PWMB01		0x0160 0x0350 0x048c 0x2 0x1
#define MXRT105X_PAD_B0_09_LPUART3_RX			0x0160 0x0350 0x0538 0x3 0x2
#define MXRT105X_PAD_B0_09_FLEXIO2_FLEXIO09		0x0160 0x0350 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_09_GPIO2_IO09			0x0160 0x0350 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_09_SRC_BOOT_CFG05		0x0160 0x0350 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_10_LCD_DATA06			0x0164 0x0354 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_10_QTIMER4_TIMER1		0x0164 0x0354 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_10_FLEXPWM2_PWMA02		0x0164 0x0354 0x0480 0x2 0x1
#define MXRT105X_PAD_B0_10_SAI1_TX_DATA03		0x0164 0x0354 0x0598 0x3 0x1
#define MXRT105X_PAD_B0_10_FLEXIO2_FLEXIO10		0x0164 0x0354 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_10_GPIO2_IO10			0x0164 0x0354 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_10_SRC_BOOT_CFG06		0x0164 0x0354 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_11_LCD_DATA07			0x0168 0x0358 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_11_QTIMER4_TIMER2		0x0168 0x0358 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_11_FLEXPWM2_PWMB02		0x0168 0x0358 0x0490 0x2 0x1
#define MXRT105X_PAD_B0_11_SAI1_TX_DATA02		0x0168 0x0358 0x059c 0x3 0x1
#define MXRT105X_PAD_B0_11_FLEXIO2_FLEXIO11		0x0168 0x0358 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_11_GPIO2_IO11			0x0168 0x0358 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_11_SRC_BOOT_CFG07		0x0168 0x0358 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_12_LCD_DATA08			0x016c 0x035c 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_12_XBAR1_INOUT10		0x016c 0x035c 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_12_SAI1_TX_DATA01		0x016c 0x035c 0x05a0 0x3 0x1
#define MXRT105X_PAD_B0_12_FLEXIO2_FLEXIO12		0x016c 0x035c 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_12_GPIO2_IO12			0x016c 0x035c 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_12_SRC_BOOT_CFG08		0x016c 0x035c 0x0000 0x6 0x0

