EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
#define MXRT105X_PAD_B0_13_LCD_DATA09			0x0170 0x0360 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_13_XBAR1_INOUT11		0x0170 0x0360 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_13_SAI1_MCLK			0x0170 0x0360 0x058c 0x3 0x2
#define MXRT105X_PAD_B0_13_FLEXIO2_FLEXIO13		0x0170 0x0360 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_13_GPIO2_IO13			0x0170 0x0360 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_13_SRC_BOOT_CFG09		0x0170 0x0360 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_14_LCD_DATA10			0x0174 0x0364 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_14_XBAR1_INOUT12		0x0174 0x0364 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_14_ARM_CM7_TXEV			0x0174 0x0364 0x0000 0x2 0x0
#define MXRT105X_PAD_B0_14_SAI1_RX_SYNC			0x0174 0x0364 0x05a4 0x3 0x2
#define MXRT105X_PAD_B0_14_FLEXIO2_FLEXIO14		0x0174 0x0364 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_14_GPIO2_IO14			0x0174 0x0364 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_14_SRC_BOOT_CFG10		0x0174 0x0364 0x0000 0x6 0x0

#define MXRT105X_PAD_B0_15_LCD_DATA11			0x0178 0x0368 0x0000 0x0 0x0
#define MXRT105X_PAD_B0_15_XBAR1_INOUT13		0x0178 0x0368 0x0000 0x1 0x0
#define MXRT105X_PAD_B0_15_ARM_CM7_RXEV			0x0178 0x0368 0x0000 0x2 0x0
#define MXRT105X_PAD_B0_15_SAI1_RX_BCLK			0x0178 0x0368 0x0590 0x3 0x2
#define MXRT105X_PAD_B0_15_FLEXIO2_FLEXIO15		0x0178 0x0368 0x0000 0x4 0x0
#define MXRT105X_PAD_B0_15_GPIO2_IO15			0x0178 0x0368 0x0000 0x5 0x0
#define MXRT105X_PAD_B0_15_SRC_BOOT_CFG11		0x0178 0x0368 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_00_LCD_DATA12			0x017c 0x036c 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_00_XBAR1_INOUT14		0x017c 0x036c 0x0644 0x1 0x1
#define MXRT105X_PAD_B1_00_LPUART4_TX			0x017c 0x036c 0x0544 0x2 0x2
#define MXRT105X_PAD_B1_00_SAI1_RX_DATA00		0x017c 0x036c 0x0594 0x3 0x2
#define MXRT105X_PAD_B1_00_FLEXIO2_FLEXIO16		0x017c 0x036c 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_00_GPIO2_IO16			0x017c 0x036c 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_00_TPSMP_HDATA14		0x017c 0x036c 0x0454 0x6 0x4

#define MXRT105X_PAD_B1_01_LCD_DATA13			0x0180 0x0370 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_01_XBAR1_INOUT15		0x0180 0x0370 0x0648 0x1 0x1
#define MXRT105X_PAD_B1_01_LPUART4_RX			0x0180 0x0370 0x0540 0x2 0x2
#define MXRT105X_PAD_B1_01_SAI1_TX_DATA00		0x0180 0x0370 0x0000 0x3 0x0
#define MXRT105X_PAD_B1_01_FLEXIO2_FLEXIO17		0x0180 0x0370 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_01_GPIO2_IO17			0x0180 0x0370 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_01_FLEXPWM1_PWMB03		0x0180 0x0370 0x0464 0x6 0x4

#define MXRT105X_PAD_B1_02_LCD_DATA14			0x0184 0x0374 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_02_XBAR1_INOUT16		0x0184 0x0374 0x064c 0x1 0x1
#define MXRT105X_PAD_B1_02_LPSPI4_PCS2			0x0184 0x0374 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_02_SAI1_TX_BCLK			0x0184 0x0374 0x05a8 0x3 0x2
#define MXRT105X_PAD_B1_02_FLEXIO2_FLEXIO18		0x0184 0x0374 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_02_GPIO2_IO18			0x0184 0x0374 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_02_FLEXPWM2_PWMA03		0x0184 0x0374 0x0474 0x6 0x4

#define MXRT105X_PAD_B1_03_LCD_DATA15			0x0188 0x0378 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_03_XBAR1_INOUT17		0x0188 0x0378 0x062c 0x1 0x3
#define MXRT105X_PAD_B1_03_LPSPI4_PCS1			0x0188 0x0378 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_03_SAI1_TX_SYNC			0x0188 0x0378 0x05ac 0x3 0x2
#define MXRT105X_PAD_B1_03_FLEXIO2_FLEXIO19		0x0188 0x0378 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_03_GPIO2_IO19			0x0188 0x0378 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_03_FLEXPWM2_PWMB03		0x0188 0x0378 0x0484 0x6 0x3

#define MXRT105X_PAD_B1_04_LCD_DATA16			0x018c 0x037c 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_04_LPSPI4_PCS0			0x018c 0x037c 0x051c 0x1 0x1
#define MXRT105X_PAD_B1_04_CSI_DATA15			0x018c 0x037c 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_04_ENET_RX_DATA00		0x018c 0x037c 0x0434 0x3 0x1
#define MXRT105X_PAD_B1_04_FLEXIO2_FLEXIO20		0x018c 0x037c 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_04_GPIO2_IO20			0x018c 0x037c 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_04_CSU_CSU_ALARM_AUT02		0x018c 0x037c 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_05_LCD_DATA17			0x0190 0x0380 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_05_LPSPI4_SDI			0x0190 0x0380 0x0524 0x1 0x1
#define MXRT105X_PAD_B1_05_CSI_DATA14			0x0190 0x0380 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_05_ENET_RX_DATA01		0x0190 0x0380 0x0438 0x3 0x1
#define MXRT105X_PAD_B1_05_FLEXIO2_FLEXIO21		0x0190 0x0380 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_05_GPIO2_IO21			0x0190 0x0380 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_05_CSU_CSU_ALARM_AUT01		0x0190 0x0380 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_06_LCD_DATA18			0x0194 0x0384 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_06_LPSPI4_SDO			0x0194 0x0384 0x0528 0x1 0x1
#define MXRT105X_PAD_B1_06_CSI_DATA13			0x0194 0x0384 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_06_ENET_RX_EN			0x0194 0x0384 0x043c 0x3 0x1
#define MXRT105X_PAD_B1_06_FLEXIO2_FLEXIO22		0x0194 0x0384 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_06_GPIO2_IO22			0x0194 0x0384 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_06_CSU_CSU_ALARM_AUT00		0x0194 0x0384 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_07_LCD_DATA19			0x0198 0x0388 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_07_LPSPI4_SCK			0x0198 0x0388 0x0520 0x1 0x1
#define MXRT105X_PAD_B1_07_CSI_DATA12			0x0198 0x0388 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_07_ENET_TX_DATA00		0x0198 0x0388 0x0000 0x3 0x0
#define MXRT105X_PAD_B1_07_FLEXIO2_FLEXIO23		0x0198 0x0388 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_07_GPIO2_IO23			0x0198 0x0388 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_07_CSU_CSU_INT_DEB		0x0198 0x0388 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_08_LCD_DATA20			0x019c 0x038c 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_08_QTIMER1_TIMER3		0x019c 0x038c 0x0000 0x1 0x0
#define MXRT105X_PAD_B1_08_CSI_DATA11			0x019c 0x038c 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_08_ENET_TX_DATA01		0x019c 0x038c 0x0000 0x3 0x0
#define MXRT105X_PAD_B1_08_FLEXIO2_FLEXIO24		0x019c 0x038c 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_08_GPIO2_IO24			0x019c 0x038c 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_08_FLEXCAN2_TX			0x019c 0x038c 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_09_LCD_DATA21			0x01a0 0x0390 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_09_QTIMER2_TIMER3		0x01a0 0x0390 0x0578 0x1 0x1
#define MXRT105X_PAD_B1_09_CSI_DATA10			0x01a0 0x0390 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_09_ENET_TX_EN			0x01a0 0x0390 0x0000 0x3 0x0
#define MXRT105X_PAD_B1_09_FLEXIO2_FLEXIO25		0x01a0 0x0390 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_09_GPIO2_IO25			0x01a0 0x0390 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_09_FLEXCAN2_RX			0x01a0 0x0390 0x0450 0x6 0x3

#define MXRT105X_PAD_B1_10_LCD_DATA22			0x01a4 0x0394 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_10_QTIMER3_TIMER3		0x01a4 0x0394 0x0588 0x1 0x2
#define MXRT105X_PAD_B1_10_CSI_DATA00			0x01a4 0x0394 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_10_ENET_TX_CLK			0x01a4 0x0394 0x0448 0x3 0x1
#define MXRT105X_PAD_B1_10_FLEXIO2_FLEXIO26		0x01a4 0x0394 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_10_GPIO2_IO26			0x01a4 0x0394 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_10_ENET_REF_CLK			0x01a4 0x0394 0x042c 0x6 0x1

#define MXRT105X_PAD_B1_11_LCD_DATA23			0x01a8 0x0398 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_11_QTIMER4_TIMER3		0x01a8 0x0398 0x0000 0x1 0x0
#define MXRT105X_PAD_B1_11_CSI_DATA01			0x01a8 0x0398 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_11_ENET_RX_ER			0x01a8 0x0398 0x0440 0x3 0x1
#define MXRT105X_PAD_B1_11_FLEXIO2_FLEXIO27		0x01a8 0x0398 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_11_GPIO2_IO27			0x01a8 0x0398 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_11_LPSPI4_PCS3			0x01a8 0x0398 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_12_LPUART5_TX			0x01ac 0x039c 0x054c 0x1 0x1
#define MXRT105X_PAD_B1_12_CSI_PIXCLK			0x01ac 0x039c 0x0424 0x2 0x1
#define MXRT105X_PAD_B1_12_ENET_1588_EVENT0_IN		0x01ac 0x039c 0x0444 0x3 0x2
#define MXRT105X_PAD_B1_12_FLEXIO2_FLEXIO28		0x01ac 0x039c 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_12_GPIO2_IO28			0x01ac 0x039c 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_12_USDHC1_CD_B			0x01ac 0x039c 0x05d4 0x6 0x2

#define MXRT105X_PAD_B1_13_WDOG1_B			0x01b0 0x03a0 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_13_LPUART5_RX			0x01b0 0x03a0 0x0548 0x1 0x1
#define MXRT105X_PAD_B1_13_CSI_VSYNC			0x01b0 0x03a0 0x0428 0x2 0x2
#define MXRT105X_PAD_B1_13_ENET_1588_EVENT0_OUT		0x01b0 0x03a0 0x0000 0x3 0x0
#define MXRT105X_PAD_B1_13_FLEXIO2_FLEXIO29		0x01b0 0x03a0 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_13_GPIO2_IO29			0x01b0 0x03a0 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_13_USDHC1_WP			0x01b0 0x03a0 0x05d8 0x6 0x3

#define MXRT105X_PAD_B1_14_ENET_MDC			0x01b4 0x03a4 0x0000 0x0 0x0
#define MXRT105X_PAD_B1_14_FLEXPWM4_PWMA02		0x01b4 0x03a4 0x049c 0x1 0x1
#define MXRT105X_PAD_B1_14_CSI_HSYNC			0x01b4 0x03a4 0x0420 0x2 0x2
#define MXRT105X_PAD_B1_14_XBAR1_IN02			0x01b4 0x03a4 0x060c 0x3 0x1
#define MXRT105X_PAD_B1_14_FLEXIO2_FLEXIO30		0x01b4 0x03a4 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_14_GPIO2_IO30			0x01b4 0x03a4 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_14_USDHC1_VSELECT		0x01b4 0x03a4 0x0000 0x6 0x0

#define MXRT105X_PAD_B1_15_ENET_MDIO			0x01b8 0x03a8 0x0430 0x0 0x2
#define MXRT105X_PAD_B1_15_FLEXPWM4_PWMA03		0x01b8 0x03a8 0x04a0 0x1 0x1
#define MXRT105X_PAD_B1_15_CSI_MCLK			0x01b8 0x03a8 0x0000 0x2 0x0
#define MXRT105X_PAD_B1_15_XBAR1_IN03			0x01b8 0x03a8 0x0610 0x3 0x1
#define MXRT105X_PAD_B1_15_FLEXIO2_FLEXIO31		0x01b8 0x03a8 0x0000 0x4 0x0
#define MXRT105X_PAD_B1_15_GPIO2_IO31			0x01b8 0x03a8 0x0000 0x5 0x0
#define MXRT105X_PAD_B1_15_USDHC1_RESET_B		0x01b8 0x03a8 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B0_00_USDHC1_CMD		0x01bc 0x03ac 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B0_00_FLEXPWM1_PWMA00		0x01bc 0x03ac 0x0458 0x1 0x1
#define MXRT105X_PAD_SD_B0_00_LPI2C3_SCL		0x01bc 0x03ac 0x04dc 0x2 0x1
#define MXRT105X_PAD_SD_B0_00_XBAR1_INOUT04		0x01bc 0x03ac 0x0614 0x3 0x1
#define MXRT105X_PAD_SD_B0_00_LPSPI1_SCK		0x01bc 0x03ac 0x04f0 0x4 0x1
#define MXRT105X_PAD_SD_B0_00_GPIO3_IO12		0x01bc 0x03ac 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B0_00_FLEXSPI_BUS2BIT_A_SS1_B	0x01bc 0x03ac 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B0_01_USDHC1_CLK		0x01c0 0x03b0 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B0_01_FLEXPWM1_PWMB00		0x01c0 0x03b0 0x0468 0x1 0x1
#define MXRT105X_PAD_SD_B0_01_LPI2C3_SDA		0x01c0 0x03b0 0x04e0 0x2 0x1
#define MXRT105X_PAD_SD_B0_01_XBAR1_INOUT05		0x01c0 0x03b0 0x0618 0x3 0x1
#define MXRT105X_PAD_SD_B0_01_LPSPI1_PCS0		0x01c0 0x03b0 0x04ec 0x4 0x0
#define MXRT105X_PAD_SD_B0_01_GPIO3_IO13		0x01c0 0x03b0 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B0_01_FLEXSPI_BUS2BIT_B_SS1_B	0x01c0 0x03b0 0x0000 0x6 0x0

