EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt105x-pinfunc.h
#define MXRT105X_PAD_SD_B0_02_USDHC1_DATA0		0x01c4 0x03b4 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B0_02_FLEXPWM1_PWMA01		0x01c4 0x03b4 0x045c 0x1 0x1
#define MXRT105X_PAD_SD_B0_02_LPUART8_CTS_B		0x01c4 0x03b4 0x0000 0x2 0x0
#define MXRT105X_PAD_SD_B0_02_XBAR1_INOUT06		0x01c4 0x03b4 0x061c 0x3 0x1
#define MXRT105X_PAD_SD_B0_02_LPSPI1_SDO		0x01c4 0x03b4 0x04f8 0x4 0x1
#define MXRT105X_PAD_SD_B0_02_GPIO3_IO14		0x01c4 0x03b4 0x0000 0x5 0x0

#define MXRT105X_PAD_SD_B0_03_USDHC1_DATA1		0x01c8 0x03b8 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B0_03_FLEXPWM1_PWMB01		0x01c8 0x03b8 0x046c 0x1 0x1
#define MXRT105X_PAD_SD_B0_03_LPUART8_RTS_B		0x01c8 0x03b8 0x0000 0x2 0x0
#define MXRT105X_PAD_SD_B0_03_XBAR1_INOUT07		0x01c8 0x03b8 0x0620 0x3 0x1
#define MXRT105X_PAD_SD_B0_03_LPSPI1_SDI		0x01c8 0x03b8 0x04f4 0x4 0x1
#define MXRT105X_PAD_SD_B0_03_GPIO3_IO15		0x01c8 0x03b8 0x0000 0x5 0x0

#define MXRT105X_PAD_SD_B0_04_USDHC1_DATA2		0x01cc 0x03bc 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B0_04_FLEXPWM1_PWMA02		0x01cc 0x03bc 0x0460 0x1 0x1
#define MXRT105X_PAD_SD_B0_04_LPUART8_TX		0x01cc 0x03bc 0x0564 0x2 0x0
#define MXRT105X_PAD_SD_B0_04_XBAR1_INOUT08		0x01cc 0x03bc 0x0624 0x3 0x1
#define MXRT105X_PAD_SD_B0_04_FLEXSPI_SS0_B		0x01cc 0x03bc 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B0_04_GPIO3_IO16		0x01cc 0x03bc 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B0_04_CCM_CLKO1			0x01cc 0x03bc 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B0_05_USDHC1_DATA3		0x01d0 0x03c0 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B0_05_FLEXPWM1_PWMB02		0x01d0 0x03c0 0x0470 0x1 0x1
#define MXRT105X_PAD_SD_B0_05_LPUART8_RX		0x01d0 0x03c0 0x0560 0x2 0x0
#define MXRT105X_PAD_SD_B0_05_XBAR1_INOUT09		0x01d0 0x03c0 0x0628 0x3 0x1
#define MXRT105X_PAD_SD_B0_05_FLEXSPI_DQS		0x01d0 0x03c0 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B0_05_GPIO3_IO17		0x01d0 0x03c0 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B0_05_CCM_CLKO2			0x01d0 0x03c0 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_00_USDHC2_DATA3		0x01d4 0x03c4 0x05f4 0x0 0x0
#define MXRT105X_PAD_SD_B1_00_FLEXSPI_DATA03		0x01d4 0x03c4 0x04c4 0x1 0x0
#define MXRT105X_PAD_SD_B1_00_FLEXPWM1_PWMA03		0x01d4 0x03c4 0x0454 0x2 0x0
#define MXRT105X_PAD_SD_B1_00_SAI1_TX_DATA03		0x01d4 0x03c4 0x0598 0x3 0x0
#define MXRT105X_PAD_SD_B1_00_LPUART4_TX		0x01d4 0x03c4 0x0544 0x4 0x0
#define MXRT105X_PAD_SD_B1_00_GPIO3_IO00		0x01d4 0x03c4 0x0000 0x5 0x0

#define MXRT105X_PAD_SD_B1_01_USDHC2_DATA2		0x01d8 0x03c8 0x05f0 0x0 0x0
#define MXRT105X_PAD_SD_B1_01_FLEXSPI_DATA02		0x01d8 0x03c8 0x04c0 0x1 0x0
#define MXRT105X_PAD_SD_B1_01_FLEXPWM1_PWMB03		0x01d8 0x03c8 0x0464 0x2 0x0
#define MXRT105X_PAD_SD_B1_01_SAI1_TX_DATA02		0x01d8 0x03c8 0x059c 0x3 0x0
#define MXRT105X_PAD_SD_B1_01_LPUART4_RX		0x01d8 0x03c8 0x0540 0x4 0x0
#define MXRT105X_PAD_SD_B1_01_GPIO3_IO01		0x01d8 0x03c8 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_01_CCM_DI0_EXT_CLK		0x01d8 0x03c8 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_02_USDHC2_DATA1		0x01dc 0x03cc 0x05ec 0x0 0x0
#define MXRT105X_PAD_SD_B1_02_FLEXSPI_DATA01		0x01dc 0x03cc 0x04bc 0x1 0x0
#define MXRT105X_PAD_SD_B1_02_FLEXPWM2_PWMA03		0x01dc 0x03cc 0x0474 0x2 0x0
#define MXRT105X_PAD_SD_B1_02_SAI1_TX_DATA01		0x01dc 0x03cc 0x05a0 0x3 0x0
#define MXRT105X_PAD_SD_B1_02_FLEXCAN1_TX		0x01dc 0x03cc 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B1_02_GPIO3_IO02		0x01dc 0x03cc 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_02_CCM_WAIT			0x01dc 0x03cc 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_03_USDHC2_DATA0		0x01e0 0x03d0 0x05e8 0x0 0x0
#define MXRT105X_PAD_SD_B1_03_FLEXSPI_DATA00		0x01e0 0x03d0 0x04b8 0x1 0x0
#define MXRT105X_PAD_SD_B1_03_FLEXPWM2_PWMB03		0x01e0 0x03d0 0x0484 0x2 0x0
#define MXRT105X_PAD_SD_B1_03_SAI1_MCLK			0x01e0 0x03d0 0x058c 0x3 0x0
#define MXRT105X_PAD_SD_B1_03_FLEXCAN1_RX		0x01e0 0x03d0 0x044c 0x4 0x0
#define MXRT105X_PAD_SD_B1_03_GPIO3_IO03		0x01e0 0x03d0 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_03_CCM_PMIC_READY		0x01e0 0x03d0 0x03fc 0x6 0x0

#define MXRT105X_PAD_SD_B1_04_USDHC2_CLK		0x01e4 0x03d4 0x05dc 0x0 0x0
#define MXRT105X_PAD_SD_B1_04_FLEXSPI_SCLK		0x01e4 0x03d4 0x0000 0x1 0x0
#define MXRT105X_PAD_SD_B1_04_LPI2C1_SCL		0x01e4 0x03d4 0x04cc 0x2 0x0
#define MXRT105X_PAD_SD_B1_04_SAI1_RX_SYNC		0x01e4 0x03d4 0x05a4 0x3 0x0
#define MXRT105X_PAD_SD_B1_04_FLEXSPI_SS1_B		0x01e4 0x03d4 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B1_04_GPIO3_IO04		0x01e4 0x03d4 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_04_CCM_STOP			0x01e4 0x03d4 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_05_USDHC2_CMD		0x01e8 0x03d8 0x05e4 0x0 0x0
#define MXRT105X_PAD_SD_B1_05_FLEXSPI_DQS		0x01e8 0x03d8 0x04a4 0x1 0x0
#define MXRT105X_PAD_SD_B1_05_LPI2C1_SDA		0x01e8 0x03d8 0x04d0 0x2 0x0
#define MXRT105X_PAD_SD_B1_05_SAI1_RX_BCLK		0x01e8 0x03d8 0x0590 0x3 0x0
#define MXRT105X_PAD_SD_B1_05_FLEXSPI_SS0_B		0x01e8 0x03d8 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B1_05_GPIO3_IO05		0x01e8 0x03d8 0x0000 0x5 0x0

#define MXRT105X_PAD_SD_B1_06_USDHC2_RESET_B		0x01ec 0x03dc 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B1_06_FLEXSPI_SS0_B		0x01ec 0x03dc 0x0000 0x1 0x0
#define MXRT105X_PAD_SD_B1_06_LPUART7_CTS_B		0x01ec 0x03dc 0x0000 0x2 0x0
#define MXRT105X_PAD_SD_B1_06_SAI1_RX_DATA00		0x01ec 0x03dc 0x0594 0x3 0x0
#define MXRT105X_PAD_SD_B1_06_LPSPI2_PCS0		0x01ec 0x03dc 0x04fc 0x4 0x0
#define MXRT105X_PAD_SD_B1_06_GPIO3_IO06		0x01ec 0x03dc 0x0000 0x5 0x0

#define MXRT105X_PAD_SD_B1_07_SEMC_CSX01		0x01f0 0x03e0 0x0000 0x0 0x0
#define MXRT105X_PAD_SD_B1_07_FLEXSPI_SCLK		0x01f0 0x03e0 0x04c8 0x1 0x0
#define MXRT105X_PAD_SD_B1_07_LPUART7_RTS_B		0x01f0 0x03e0 0x0000 0x2 0x0
#define MXRT105X_PAD_SD_B1_07_SAI1_TX_DATA00		0x01f0 0x03e0 0x0000 0x3 0x0
#define MXRT105X_PAD_SD_B1_07_LPSPI2_SCK		0x01f0 0x03e0 0x0500 0x4 0x0
#define MXRT105X_PAD_SD_B1_07_GPIO3_IO07		0x01f0 0x03e0 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_07_CCM_REF_EN_B		0x01f0 0x03e0 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_08_USDHC2_DATA4		0x01f4 0x03e4 0x05f8 0x0 0x0
#define MXRT105X_PAD_SD_B1_08_FLEXSPI_DATA00		0x01f4 0x03e4 0x04a8 0x1 0x0
#define MXRT105X_PAD_SD_B1_08_LPUART7_TX		0x01f4 0x03e4 0x055c 0x2 0x0
#define MXRT105X_PAD_SD_B1_08_SAI1_TX_BCLK		0x01f4 0x03e4 0x05a8 0x3 0x0
#define MXRT105X_PAD_SD_B1_08_LPSPI2_SD0		0x01f4 0x03e4 0x0508 0x4 0x0
#define MXRT105X_PAD_SD_B1_08_GPIO3_IO08		0x01f4 0x03e4 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_08_SEMC_CSX02		0x01f4 0x03e4 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_09_USDHC2_DATA5		0x01f8 0x03e8 0x05fc 0x0 0x0
#define MXRT105X_PAD_SD_B1_09_FLEXSPI_DATA01		0x01f8 0x03e8 0x04ac 0x1 0x0
#define MXRT105X_PAD_SD_B1_09_LPUART7_RX		0x01f8 0x03e8 0x0558 0x2 0x0
#define MXRT105X_PAD_SD_B1_09_SAI1_TX_SYNC		0x01f8 0x03e8 0x05ac 0x3 0x0
#define MXRT105X_PAD_SD_B1_09_LPSPI2_SDI		0x01f8 0x03e8 0x0504 0x4 0x0
#define MXRT105X_PAD_SD_B1_09_GPIO3_IO09		0x01f8 0x03e8 0x0000 0x5 0x0

#define MXRT105X_PAD_SD_B1_10_USDHC2_DATA6		0x01fc 0x03ec 0x0600 0x0 0x0
#define MXRT105X_PAD_SD_B1_10_FLEXSPI_DATA02		0x01fc 0x03ec 0x04b0 0x1 0x0
#define MXRT105X_PAD_SD_B1_10_LPUART2_RX		0x01fc 0x03ec 0x052c 0x2 0x0
#define MXRT105X_PAD_SD_B1_10_LPI2C2_SDA		0x01fc 0x03ec 0x04d8 0x3 0x0
#define MXRT105X_PAD_SD_B1_10_LPSPI2_PCS2		0x01fc 0x03ec 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B1_10_GPIO3_IO10		0x01fc 0x03ec 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_10_SRC_SYSTEM_RESET		0x01fc 0x03ec 0x0000 0x6 0x0

#define MXRT105X_PAD_SD_B1_11_USDHC2_DATA7		0x0200 0x03f0 0x0604 0x0 0x0
#define MXRT105X_PAD_SD_B1_11_FLEXSPI_DATA03		0x0200 0x03f0 0x04b4 0x1 0x0
#define MXRT105X_PAD_SD_B1_11_LPUART2_TX		0x0200 0x03f0 0x0530 0x2 0x0
#define MXRT105X_PAD_SD_B1_11_LPI2C2_SCL		0x0200 0x03f0 0x04d4 0x3 0x0
#define MXRT105X_PAD_SD_B1_11_LPSPI2_PCS3		0x0200 0x03f0 0x0000 0x4 0x0
#define MXRT105X_PAD_SD_B1_11_GPIO3_IO11		0x0200 0x03f0 0x0000 0x5 0x0
#define MXRT105X_PAD_SD_B1_11_SRC_EARLY_RESET		0x0200 0x03f0 0x0000 0x6 0x0


#endif /* __DTS_IMXRT105X_PINFUNC_H */
